import json
from typing import Any, Hashable

import pytest


@pytest.fixture
def data_fixture() -> list[dict[Hashable, Any]]:
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Номер карты": "*4567",
            "Сумма платежа": -10,
            "Категория": "покупка",
            "Описание": "пятерочка",
        },
        {
            "Дата операции": "15.12.2021 16:44:00",
            "Номер карты": "*3456",
            "Сумма платежа": 11,
            "Категория": "пополнение",
            "Описание": "банкомат",
        },
        {
            "Дата операции": "10.12.2021 16:44:00",
            "Номер карты": "*1234",
            "Сумма платежа": -12,
            "Категория": "покупка",
            "Описание": "пятерочка",
        },
        {
            "Дата операции": "02.12.2021 16:44:00",
            "Номер карты": "*2345",
            "Сумма платежа": -13,
            "Категория": "покупка",
            "Описание": "пятерочка",
        },
        {
            "Дата операции": "01.12.2021 16:44:00",
            "Номер карты": "*1234",
            "Сумма платежа": -14,
            "Категория": "покупка",
            "Описание": "пятерочка",
        },
    ]


@pytest.fixture
def fake_user_settings() -> str:
    return json.dumps({"user_currencies": ["USD"], "user_stocks": ["AAPL"]})


@pytest.fixture
def fake_api_response_1() -> dict[str, Any]:
    return {"base": "USD", "rates": {"RUB": 75.0}}


@pytest.fixture
def fake_api_response_2() -> dict[str, Any]:
    return {"ticker": "AAPL", "price": 75.0}
