import datetime
import json
import logging
import os
from collections import Counter as cou
from typing import Any, Counter, Generator, Hashable

import pandas as pd
import requests
from dotenv import load_dotenv

load_dotenv(".env")

utils_logger = logging.getLogger("Вспомогательные функции")

logs_directory = os.path.abspath(os.path.join(os.path.dirname(__file__), "..", "logs"))
utils_handler = logging.FileHandler(os.path.join(logs_directory, "utils.log"), mode="w", encoding="utf-8")

utils_formatter = logging.Formatter(
    "%(asctime)s - %(name)s - Имя файла: %(filename)s - Имя функции: %(funcName)s \n%(levelname)s - %(message)s"
)
utils_handler.setFormatter(utils_formatter)
utils_logger.addHandler(utils_handler)
utils_logger.setLevel(logging.DEBUG)


def greeting(date_time_now: datetime.datetime) -> str:
    """
    Функция, возвращающая приветствие в соответствии с временем суток

    :param date_time_now: дата и время на данный момент
    :type date_time_now: 'datetime.datetime'
    :return: приветствие
    :rtype: str
    """
    hour = date_time_now.hour
    utils_logger.debug(f"Получаем часы суток ({hour})")
    utils_logger.info("Функция закончила работу")

    if 0 <= hour < 6:
        return "Доброй ночи"
    elif 6 <= hour < 12:
        return "Доброе утро"
    elif 12 <= hour < 18:
        return "Добрый день"
    else:
        return "Добрый вечер"


# print(greeting(datetime.datetime.now()))
# print(datetime.datetime.now())


def xlsx_file_reader(path_to_the_file: str) -> list[dict[Hashable, Any]]:
    """
    Функция, считывающая XLSX-файл и выводящая содержимое

    :param path_to_the_file: путь до XLSX-файла
    :type path_to_the_file: str
    :return: данные из файла
    :rtype: list[dict[Hashable, Any]]
    """
    utils_logger.debug("Считываем XLSX-файл с помощью pandas")
    transactions = pd.read_excel(path_to_the_file, engine="openpyxl")

    utils_logger.debug("Форматируем данные в словарь")
    data = transactions.to_dict(orient="records")

    utils_logger.info("Возвращаем содержимое файла operations.xlsx в виде списка словарей")
    return data


# print(xlsx_file_reader('../data/operations.xlsx'))


def filtering_by_date_month(
    data: list[dict[Hashable, Any]], date_time_now: datetime.datetime
) -> list[dict[Hashable, Any]]:
    """
    Функция, фильтрующая транзакции в диапазоне с начала месяца по текущий день

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :param date_time_now: дата и время на текущий момент
    :type date_time_now: 'datetime.datetime'
    :return: транзакции с начала месяца
    :rtype: list[dict[Hashable, Any]]
    """
    start_datetime = date_time_now.replace(day=1, hour=0, minute=0, second=0)
    end_datetime = date_time_now
    utils_logger.debug(f"Получаем начало месяца ({start_datetime}) и конечную дату ({end_datetime})")

    result_data = [
        dict_
        for dict_ in data
        if start_datetime <= datetime.datetime.strptime(dict_["Дата операции"], "%d.%m.%Y %H:%M:%S") <= end_datetime
    ]

    utils_logger.info("Возвращаем отсортированные транзакции")
    return result_data


# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# print(filtering_by_date_month(data_first, date_obj))


def filtering_by_date_weekday(
    data: list[dict[Hashable, Any]], date_time_now: datetime.datetime
) -> list[dict[Hashable, Any]]:
    """
    Функция, фильтрующая транзакции в диапазоне с начала недели по текущий день

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :param date_time_now: дата и время на текущий момент
    :type date_time_now: 'datetime.datetime'
    :return: транзакции с начала недели
    :rtype: list[dict[Hashable, Any]]
    """
    start_datetime = date_time_now - datetime.timedelta(days=date_time_now.weekday())
    start_datetime = start_datetime.replace(hour=0, minute=0, second=0)
    end_datetime = date_time_now
    utils_logger.debug(f"Получаем начало недели ({start_datetime}) и конечную дату ({end_datetime})")

    result_data = [
        dict_
        for dict_ in data
        if start_datetime <= datetime.datetime.strptime(dict_["Дата операции"], "%d.%m.%Y %H:%M:%S") <= end_datetime
    ]

    utils_logger.info("Возвращаем отсортированные транзакции")
    return result_data


# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# print(filtering_by_date_weekday(data_first, date_obj))


def filtering_by_date_year(
    data: list[dict[Hashable, Any]], date_time_now: datetime.datetime
) -> list[dict[Hashable, Any]]:
    """
    Функция, фильтрующая транзакции в диапазоне с начала года по текущий день

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :param date_time_now: дата и время на текущий момент
    :type date_time_now: 'datetime.datetime'
    :return: транзакции с начала года
    :rtype: list[dict[Hashable, Any]]
    """
    start_datetime = date_time_now.replace(month=1, day=1, hour=0, minute=0, second=0)
    end_datetime = date_time_now
    utils_logger.debug(f"Получаем начало года ({start_datetime}) и конечную дату ({end_datetime})")

    result_data = [
        dict_
        for dict_ in data
        if start_datetime <= datetime.datetime.strptime(dict_["Дата операции"], "%d.%m.%Y %H:%M:%S") <= end_datetime
    ]

    utils_logger.info("Возвращаем отсортированные транзакции")
    return result_data


# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# file_path = "../data/operations.xlsx"
# data_first = xlsx_file_reader(file_path)
# print(filtering_by_date_year(data_first, date_obj))


def filtering_by_date_all(
    data: list[dict[Hashable, Any]], date_time_now: datetime.datetime
) -> list[dict[Hashable, Any]]:
    """
    Функция, фильтрующая транзакции в диапазоне с самого начала по текущий день

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :param date_time_now: дата и время на текущий момент
    :type date_time_now: 'datetime.datetime'
    :return: транзакции с самого начала
    :rtype: list[dict[Hashable, Any]]
    """
    start_datetime = datetime.datetime.min
    end_datetime = date_time_now
    utils_logger.debug(f"Получаем начальную ({start_datetime}) и конечную даты ({end_datetime})")

    result_data = [
        dict_
        for dict_ in data
        if start_datetime <= datetime.datetime.strptime(dict_["Дата операции"], "%d.%m.%Y %H:%M:%S") <= end_datetime
    ]

    utils_logger.info("Возвращаем отсортированные транзакции")
    return result_data


# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# print(filtering_by_date_all(data_first, date_obj))


def cards(data: list[dict[Hashable, Any]]) -> Generator[str, None, None]:
    """
    Функция, выдающая номера всех карт

    :param data: список операций
    :type data: list[dict[Hashable, Any]]
    :return: генератор номер карты
    """
    utils_logger.info("Возвращаем номера карт")
    for dict_ in data:
        if isinstance(dict_["Номер карты"], str):
            yield dict_["Номер карты"]  # [1:]


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# print(list(set(cards(data_first))))


def total_expenses(data: list[dict[Hashable, Any]], numbers_cards: list[str]) -> dict[str, float]:
    """
    Функция, суммирующая расходы за месяц по каждой карте

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :param numbers_cards: номера всех карт
    :type numbers_cards: list[str]
    :return: словарь, где ключ - номер карты, значение - сумма расходов
    :rtype: dict[str, float]
    """
    category_counter: Counter[str] = cou()

    utils_logger.debug("Перебираем операции и суммируем расходы по каждой карте")
    for dict_ in data:
        card = dict_.get("Номер карты")
        if card in numbers_cards and dict_["Сумма платежа"] < 0:
            category_counter[card] += abs(dict_["Сумма платежа"])

    utils_logger.info("Возвращаем словарь с суммами расходов по каждой карте")
    return dict(category_counter)


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# print(total_expenses(filtering_by_date_month(data_first, date_obj), list(set(cards(data_first)))))


def cashback(expenditure: float) -> float:
    """
    Функция, рассчитывающая кэшбэк, исходя из суммы расходов

    :param expenditure:  расход
    :type expenditure: float
    :return: сумма кэшбэка, округленная до 2 знаков после запятой
    :rtype: float
    """
    utils_logger.info(f"Возвращаем кэшбэк: {expenditure} / 100 = {round(expenditure / 100, 2)}")
    return round(expenditure / 100, 2)


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# total_expenses_ = total_expenses(data_second, list(set(cards(data_first))))
# print(total_expenses_['*7197'], cashback(total_expenses_['*7197']))
# print(total_expenses_['*4556'], cashback(total_expenses_['*4556']))


def top_transactions(data: list[dict[Hashable, Any]]) -> list[dict[str, Any]]:
    """
    Функция, возвращающая ТОП-5 транзакций по сумме операции

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :return: ТОП-5 транзакций
    :rtype: list[dict[str, Any]]
    """
    utils_logger.debug("Сортируем транзакции по сумме платежа")
    sort_by_summ = sorted(data, key=lambda dictionary: abs(dictionary["Сумма платежа"]), reverse=True)

    utils_logger.debug("Отбираем 5 транзакций с самыми большими суммами платежа")
    top_5_transactions_ = sort_by_summ[:5]

    utils_logger.debug("Сортируем транзакции по дате по убыванию")
    top_transactions_ = sorted(top_5_transactions_, key=lambda dictionary: dictionary["Дата операции"], reverse=True)

    utils_logger.debug("Формируем список транзакций в соответствии с ТЗ")
    result = []
    for transaction in top_transactions_:
        result.append(
            {
                "date": transaction["Дата операции"][:10],
                "amount": transaction["Сумма платежа"],
                "category": transaction["Категория"],
                "description": transaction["Описание"],
            }
        )

    utils_logger.info("Возвращаем ТОП-5 транзакций по сумме платежа")
    return result


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(top_transactions(data_second))
lol = [
    {
        "Дата операции": "12.02.2021 12:27:32",
        "Дата платежа": "12.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -278.52,
        "Валюта операции": "RUB",
        "Сумма платежа": -278.52,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 5,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 278.52,
    },
    {
        "Дата операции": "11.02.2021 18:29:51",
        "Дата платежа": "11.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -55.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -55.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 55.0,
    },
    {
        "Дата операции": "11.02.2021 18:28:46",
        "Дата платежа": "11.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -53.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -53.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Rumyanyj Khleb",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 53.0,
    },
    {
        "Дата операции": "11.02.2021 17:59:47",
        "Дата платежа": "11.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Pingvin Kofe I Chaj",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "11.02.2021 13:55:37",
        "Дата платежа": "11.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -20.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -20.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Связь",
        "MCC": 7379.0,
        "Описание": "Devajs Servis.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 20.0,
    },
    {
        "Дата операции": "10.02.2021 18:19:53",
        "Дата платежа": "10.02.2021",
        "Номер карты": None,
        "Статус": "OK",
        "Сумма операции": -85000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -85000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Переводы",
        "MCC": None,
        "Описание": "Николай Н.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 85000.0,
    },
    {
        "Дата операции": "10.02.2021 17:29:16",
        "Дата платежа": "10.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Pingvin Kofe I Chaj",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0,
    },
    {
        "Дата операции": "10.02.2021 16:14:59",
        "Дата платежа": "10.02.2021",
        "Номер карты": "*4556",
        "Статус": "OK",
        "Сумма операции": 486.2,
        "Валюта операции": "RUB",
        "Сумма платежа": 486.2,
        "Валюта платежа": "RUB",
        "Кэшбэк": -24.0,
        "Категория": "Ж/д билеты",
        "MCC": 4112.0,
        "Описание": "РЖД",
        "Бонусы (включая кэшбэк)": -24,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 486.2,
    },
    {
        "Дата операции": "10.02.2021 14:43:05",
        "Дата платежа": "10.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Pingvin Kofe I Chaj",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "10.02.2021 13:33:59",
        "Дата платежа": "10.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -130.07,
        "Валюта операции": "RUB",
        "Сумма платежа": -130.07,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 130.07,
    },
    {
        "Дата операции": "09.02.2021 18:33:05",
        "Дата платежа": "09.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -55.2,
        "Валюта операции": "RUB",
        "Сумма платежа": -55.2,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Различные товары",
        "MCC": 5945.0,
        "Описание": "Детский Мир",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 55.2,
    },
    {
        "Дата операции": "09.02.2021 17:09:49",
        "Дата платежа": "09.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -55.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -55.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Piterskij Ponchik",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 55.0,
    },
    {
        "Дата операции": "09.02.2021 16:40:23",
        "Дата платежа": "09.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -83.28,
        "Валюта операции": "RUB",
        "Сумма платежа": -83.28,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 83.28,
    },
    {
        "Дата операции": "09.02.2021 16:39:34",
        "Дата платежа": "09.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -56.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -56.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Rumyanyj Khleb",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 56.0,
    },
    {
        "Дата операции": "09.02.2021 12:44:00",
        "Дата платежа": "09.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -57.99,
        "Валюта операции": "RUB",
        "Сумма платежа": -57.99,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 57.99,
    },
    {
        "Дата операции": "08.02.2021 14:10:15",
        "Дата платежа": "08.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -239.98,
        "Валюта операции": "RUB",
        "Сумма платежа": -239.98,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 4,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 239.98,
    },
    {
        "Дата операции": "08.02.2021 14:07:17",
        "Дата платежа": "08.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -130.41,
        "Валюта операции": "RUB",
        "Сумма платежа": -130.41,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 130.41,
    },
    {
        "Дата операции": "08.02.2021 13:07:53",
        "Дата платежа": "08.02.2021",
        "Номер карты": "*4556",
        "Статус": "OK",
        "Сумма операции": -599.8,
        "Валюта операции": "RUB",
        "Сумма платежа": -599.8,
        "Валюта платежа": "RUB",
        "Кэшбэк": 29.0,
        "Категория": "Ж/д билеты",
        "MCC": 4112.0,
        "Описание": "РЖД",
        "Бонусы (включая кэшбэк)": 29,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 599.8,
    },
    {
        "Дата операции": "07.02.2021 18:03:22",
        "Дата платежа": "07.02.2021",
        "Номер карты": "*4556",
        "Статус": "OK",
        "Сумма операции": -599.8,
        "Валюта операции": "RUB",
        "Сумма платежа": -599.8,
        "Валюта платежа": "RUB",
        "Кэшбэк": 29.0,
        "Категория": "Ж/д билеты",
        "MCC": 4112.0,
        "Описание": "РЖД",
        "Бонусы (включая кэшбэк)": 29,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 599.8,
    },
    {
        "Дата операции": "07.02.2021 14:45:00",
        "Дата платежа": "07.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -296.82,
        "Валюта операции": "RUB",
        "Сумма платежа": -296.82,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "DIVAGE",
        "Бонусы (включая кэшбэк)": 5,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 296.82,
    },
    {
        "Дата операции": "07.02.2021 14:19:23",
        "Дата платежа": "07.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -540.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -540.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "IP Gorskaya Vv",
        "Бонусы (включая кэшбэк)": 10,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 540.0,
    },
    {
        "Дата операции": "07.02.2021 12:51:56",
        "Дата платежа": "07.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -305.56,
        "Валюта операции": "RUB",
        "Сумма платежа": -305.56,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 305.56,
    },
    {
        "Дата операции": "07.02.2021 12:24:23",
        "Дата платежа": "07.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -92.16,
        "Валюта операции": "RUB",
        "Сумма платежа": -92.16,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 92.16,
    },
    {
        "Дата операции": "06.02.2021 18:31:03",
        "Дата платежа": "06.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "IP Yakubovskaya M.V.",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "06.02.2021 12:50:47",
        "Дата платежа": "06.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -138.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -138.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 138.0,
    },
    {
        "Дата операции": "05.02.2021 18:34:26",
        "Дата платежа": "05.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -45.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -45.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Рестораны",
        "MCC": 5812.0,
        "Описание": "Kebab 24 Mm",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 45.0,
    },
    {
        "Дата операции": "05.02.2021 13:05:51",
        "Дата платежа": "05.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "IP Yakubovskaya M.V.",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "05.02.2021 12:59:16",
        "Дата платежа": "05.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -56.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -56.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Rumyanyj Khleb",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 56.0,
    },
    {
        "Дата операции": "05.02.2021 12:58:33",
        "Дата платежа": "05.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -96.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -96.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 96.0,
    },
    {
        "Дата операции": "05.02.2021 08:40:52",
        "Дата платежа": "05.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -54.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -54.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Supermarket 101",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 54.0,
    },
    {
        "Дата операции": "04.02.2021 18:44:42",
        "Дата платежа": "04.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -145.96,
        "Валюта операции": "RUB",
        "Сумма платежа": -145.96,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 145.96,
    },
    {
        "Дата операции": "04.02.2021 16:48:22",
        "Дата платежа": "04.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "IP Yakubovskaya M.V.",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "04.02.2021 08:08:28",
        "Дата платежа": "04.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -54.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -54.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Supermarket 101",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 54.0,
    },
    {
        "Дата операции": "03.02.2021 21:05:12",
        "Дата платежа": "06.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -300.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -300.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Транспорт",
        "MCC": 4111.0,
        "Описание": "Метро Санкт-Петербург",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 300.0,
    },
    {
        "Дата операции": "03.02.2021 17:37:58",
        "Дата платежа": "03.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Pingvin Kofe I Chaj",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "03.02.2021 14:26:22",
        "Дата платежа": "03.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "IP Yakubovskaya M.V.",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0,
    },
    {
        "Дата операции": "03.02.2021 13:23:26",
        "Дата платежа": "03.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -247.08,
        "Валюта операции": "RUB",
        "Сумма платежа": -247.08,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 4,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 247.08,
    },
    {
        "Дата операции": "02.02.2021 18:32:06",
        "Дата платежа": "02.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -45.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -45.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Рестораны",
        "MCC": 5812.0,
        "Описание": "Kebab 24 Mm",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 45.0,
    },
    {
        "Дата операции": "02.02.2021 15:21:34",
        "Дата платежа": "02.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -239.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -239.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 4,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 239.0,
    },
    {
        "Дата операции": "02.02.2021 15:09:58",
        "Дата платежа": "04.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -700.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -700.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Транспорт",
        "MCC": 4111.0,
        "Описание": "Метро Санкт-Петербург",
        "Бонусы (включая кэшбэк)": 14,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 700.0,
    },
    {
        "Дата операции": "02.02.2021 12:07:01",
        "Дата платежа": "02.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -129.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -129.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "IP Yakubovskaya M.V.",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 129.0,
    },
    {
        "Дата операции": "02.02.2021 11:48:55",
        "Дата платежа": "02.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -138.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -138.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 138.0,
    },
    {
        "Дата операции": "02.02.2021 11:48:23",
        "Дата платежа": "02.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -56.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -56.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Rumyanyj Khleb",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 56.0,
    },
    {
        "Дата операции": "01.02.2021 18:43:51",
        "Дата платежа": "01.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -357.96,
        "Валюта операции": "RUB",
        "Сумма платежа": -357.96,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Магнит",
        "Бонусы (включая кэшбэк)": 7,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 357.96,
    },
    {
        "Дата операции": "01.02.2021 16:12:01",
        "Дата платежа": "01.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "Pingvin Kofe I Chaj",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0,
    },
    {
        "Дата операции": "01.02.2021 14:13:15",
        "Дата платежа": "01.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -30.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -30.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Связь",
        "MCC": 7379.0,
        "Описание": "Devajs Servis.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 30.0,
    },
    {
        "Дата операции": "01.02.2021 12:09:06",
        "Дата платежа": "01.02.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -96.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -96.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 96.0,
    },
    {
        "Дата операции": "31.01.2021 18:02:32",
        "Дата платежа": "31.01.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -190.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -190.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": None,
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": '"Coffee 3"',
        "Бонусы (включая кэшбэк)": 3,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 190.0,
    },
]
# print(top_transactions(lol))


def exchange_rate() -> list[dict[str, Any]]:
    """
    Функция, возвращающая курс валют из файла user_settings.json

    :return: список словарей, где ключ - валюта пользователя, значение - курс этой валюты по отношению к рублю
    :rtype: list[dict[str, Any]]
    """
    utils_logger.debug("Получаем API-ключ из файла .env")
    api_key = os.getenv("API_KEY_1")
    headers = {"apikey": f"{api_key}"}
    url = "https://api.apilayer.com/exchangerates_data/latest"

    utils_logger.debug("Открываем файл с пользовательскими данными")
    root_directory = os.path.abspath(os.path.join(os.path.dirname(__file__), ".."))
    file_in_root = os.path.join(root_directory, "user_settings.json")
    with open(file_in_root) as f:
        data = json.load(f)

    utils_logger.debug("Получаем из файла валюты пользователя")
    list_user_currencies = data["user_currencies"]

    utils_logger.debug("Получаем курс валют и формируем из этого список в соответствии с ТЗ")
    list_result = []
    for currency_ in list_user_currencies:
        payload = {"symbols": "RUB", "base": currency_}
        response = requests.get(url, headers=headers, params=payload)
        status_code = response.status_code
        if status_code == 200:
            result = response.json()
            list_result.append({"currency": result["base"], "rate": round(result["rates"]["RUB"], 2)})
            utils_logger.debug(f'Валюта: {result["base"]}, стоимость: {round(result["rates"]["RUB"], 2)}')

    utils_logger.info("Возвращаем курс пользовательских валют")
    return list_result


# print(exchange_rate())


def stock_price() -> list[dict[str, Any]]:
    """
    Функция, возвращающая курс акций из файла user_settings.json

    :return: словарь, где ключ - акция пользователя, значение - курс этой акции
    :rtype: list[dict[str, Any]]
    """
    utils_logger.debug("Получаем API-ключ из файла .env")
    api_key = os.getenv("API_KEY_2")
    headers = {"X-Api-Key": f"{api_key}"}
    url = "https://api.api-ninjas.com/v1/stockprice"

    utils_logger.debug("Открываем файл с пользовательскими данными")
    root_directory = os.path.abspath(os.path.join(os.path.dirname(__file__), ".."))
    file_in_root = os.path.join(root_directory, "user_settings.json")
    with open(file_in_root) as f:
        data = json.load(f)

    utils_logger.debug("Получаем из файла акции пользователя")
    list_user_stocks = data["user_stocks"]

    utils_logger.debug("Получаем курс акций и формируем из этого список в соответствии с ТЗ")
    list_result = []
    for stock_ in list_user_stocks:
        payload = {"ticker": stock_}
        response = requests.get(url, headers=headers, params=payload)
        status_code = response.status_code
        if status_code == 200:
            result = response.json()
            list_result.append({"stock": result["ticker"], "price": round(result["price"], 2)})
            utils_logger.debug(f'Акция: {result["ticker"]}, стоимость: {round(result["price"], 2)}')

    utils_logger.info("Возвращаем курс пользовательских валют")
    return list_result


# print(stock_price())


def total_expenses_total(data: list[dict[Hashable, Any]]) -> float:
    """
    Функция, суммирующая расходы всего

    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :return: сумма расходов
    :rtype: float
    """
    utils_logger.debug("Перебираем операции и суммируем расходы")
    expenses = 0
    for dict_ in data:
        if dict_["Сумма платежа"] < 0:
            expenses += abs(dict_["Сумма платежа"])

    utils_logger.info(f"Возвращаем сумму расходов {expenses}")
    return round(expenses, 2)


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(total_expenses_total(data_second))
# print(total_expenses_total(lol))


def main_expenses(data: list[dict[Hashable, Any]]) -> list[dict[str, float]]:
    """
    Функция, возвращающая сумму расходов по 7 категориям по убыванию
    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :return: список словарей с суммами расходов по категориям
    :rtype: list[dict[str, float]]
    """
    utils_logger.debug("Перебираем словари и суммируем расходы по категориям расходов")
    dict_expenses = {}
    for dict_ in data:
        if (
            not dict_["Категория"] in dict_expenses
            and dict_["Сумма платежа"] < 0
            and not dict_["Категория"] in ["Наличные", "Переводы"]
        ):
            dict_expenses[dict_["Категория"]] = abs(dict_["Сумма платежа"])
        elif dict_["Категория"] in dict_expenses and dict_["Сумма платежа"] < 0:
            dict_expenses[dict_["Категория"]] += abs(dict_["Сумма платежа"])

    utils_logger.debug("Формируем структуру ответа в соответствии с ТЗ")
    sorted_list = [
        {"category": category, "amount": round(amount, 2)}
        for category, amount in sorted(dict_expenses.items(), key=lambda item: item[1], reverse=True)
    ]

    utils_logger.debug('Проверяем на наличие "остальных" расходов')
    the_rest_category = sum(list(dict_expenses.values())[7:])
    result_list = sorted_list[:7]
    if the_rest_category > 0:
        result_list.append({"category": "Остальное", "amount": round(the_rest_category, 2)})

    utils_logger.info("Возвращаем список словарей с тратами по категориям")
    return result_list


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(main_expenses(data_second))
# print(main_expenses(lol))


def transfers_and_cash(data: list[dict[Hashable, Any]]) -> list[dict[str, float]]:
    """
    Функция, возвращающая сумму выдачи наличных и переводов
    :param data: список транзакций
    :type data: list[dict[Hashable, Any]]
    :return: список словарей с суммами расходов по категориям
    :rtype: list[dict[str, float]]
    """
    utils_logger.debug('Перебираем словари и суммируем расходы по категориям "Переводы" и "Наличные"')
    dict_expenses = {}
    for dict_ in data:
        if (
            not dict_["Категория"] in dict_expenses
            and dict_["Сумма платежа"] < 0
            and (dict_["Категория"] == "Наличные" or dict_["Категория"] == "Переводы")
        ):
            dict_expenses[dict_["Категория"]] = abs(dict_["Сумма платежа"])
        elif dict_["Категория"] in dict_expenses and dict_["Сумма платежа"] < 0:
            dict_expenses[dict_["Категория"]] += abs(dict_["Сумма платежа"])

    utils_logger.debug("Формируем структуру ответа в соответствии с ТЗ")
    sorted_list = [
        {"category": category, "amount": round(amount, 2)}
        for category, amount in sorted(dict_expenses.items(), key=lambda item: item[1], reverse=True)
    ]

    utils_logger.info('Возвращаем список словарей с тратами по категориям "Переводы" и "Наличные"')
    return sorted_list


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(transfers_and_cash(data_second))
# print(transfers_and_cash(lol))


def total_amount_of_receipts(data: list[dict[Hashable, Any]]) -> float:
    """
    Функция, возвращающая сумму поступлений
    :param data: список операций
    :type data: list[dict[Hashable, Any]]
    :return: сумма поступлений
    :rtype: float
    """
    utils_logger.debug("Перебираем операции и суммируем поступления")
    expenses = 0
    for dict_ in data:
        if dict_["Сумма платежа"] > 0:
            expenses += dict_["Сумма платежа"]

    utils_logger.info(f"Возвращаем сумму поступлений {expenses}")
    return round(expenses, 2)


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(total_amount_of_receipts(data_second))
# print(total_amount_of_receipts(lol))


def main_receipts(data: list[dict[Hashable, Any]]) -> list[dict[str, float]]:
    """
    Функция, возвращающая сумму поступлений по категориям по убыванию
    :param data: list[dict[Hashable, Any]]
    :return: список словарей с суммами поступлений по категориям
    :rtype: list[dict[str, float]]
    """
    utils_logger.debug("Перебираем словари и суммируем поступления по категориям")
    dict_expenses = {}
    for dict_ in data:
        if not dict_["Категория"] in dict_expenses and dict_["Сумма платежа"] > 0:
            dict_expenses[dict_["Категория"]] = dict_["Сумма платежа"]
        elif dict_["Категория"] in dict_expenses and dict_["Сумма платежа"] > 0:
            dict_expenses[dict_["Категория"]] += dict_["Сумма платежа"]

    utils_logger.debug("Формируем структуру ответа в соответствии с ТЗ")
    sorted_list = [
        {"category": category, "amount": round(amount, 2)}
        for category, amount in sorted(dict_expenses.items(), key=lambda item: item[1], reverse=True)
    ]

    utils_logger.info("Возвращаем список словарей с поступлениями по категориям")
    return sorted_list


# file_path = '../data/operations.xlsx'
# data_first = xlsx_file_reader(file_path)
# date_obj = datetime.datetime(2021, 2, 12, 15, 45, 0)
# data_second = filtering_by_date_month(data_first, date_obj)
# print(main_receipts(data_second))
# print(main_receipts(lol))
